In [1]:
import pandas as pd

In [2]:
path = "dataset/titanic/"

In [3]:
dt_train = pd.read_csv(path+"train.csv")

In [4]:
dt_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
dt_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [7]:
dt_train['Cabin'].value_counts()

G6             4
B96 B98        4
C23 C25 C27    4
F33            3
E101           3
              ..
E58            1
E49            1
B80            1
F E69          1
C148           1
Name: Cabin, Length: 147, dtype: int64

In [56]:
dt_train_wout_cabin = dt_train.drop(columns=['Cabin'])

In [57]:
dt_train_wout_cabin.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(4)
memory usage: 76.7+ KB

In [58]:
dt_train_wout_cabin['Age'].fillna(round(dt_train['Age'].mean(), 2), inplace=True)

In [59]:
dt_train_wout_cabin.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          891 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(4)
memory usage: 76.7+ KB

In [49]:
dt_train_wout_cabin.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S

In [50]:
 dt_train_wout_cabin['Ticket'].value_counts()

347082      7
CA. 2343    7
1601        7
CA 2144     6
3101295     6
           ..
PC 17318    1
349203      1
341826      1
364498      1
349215      1
Name: Ticket, Length: 681, dtype: int64

In [30]:
 dt_train_wout_cabin['Ticket'].value_counts().max()

7

In [60]:
dt_cat = dt_train_wout_cabin['Embarked']

In [52]:
dt_cat.head(10)

0    S
1    C
2    S
3    S
4    S
5    Q
6    S
7    S
8    S
9    C
Name: Embarked, dtype: object

In [61]:
#É possível ver que a coluna Embarked é uma coluna categórica
#Então, usando o método factorize() do pandas, podemos criar um array
#que atribuirá valores numéricos inteiros as categorias
dt_cat_encoded, dt_cat_categories = dt_cat.factorize()

In [62]:
dt_cat_encoded[:10]

array([0, 1, 0, 0, 0, 2, 0, 0, 0, 1], dtype=int64)

In [63]:
#Nota-se que existem 3 categorias ['S', 'C', 'Q']
dt_cat_categories

Index(['S', 'C', 'Q'], dtype='object')

In [64]:
#Confirma-se a tese de que existem valores ausentes na coluna 'Embarked'
dt_train_wout_cabin['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [65]:
#Porém, ao contar os valores para cada categoria, não aparece nenhum valor ausente
dt_train_wout_cabin['Embarked'].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [66]:
#Como a soma é 889 então existem valores ausentes
dt_train_wout_cabin['Embarked'].value_counts().sum()

889

In [69]:
dt_wout_na = dt_train_wout_cabin.dropna()

In [70]:
dt_wout_na.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 889 entries, 0 to 890
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  889 non-null    int64
 1   Survived     889 non-null    int64
 2   Pclass       889 non-null    int64
 3   Name         889 non-null    object
 4   Sex          889 non-null    object
 5   Age          889 non-null    float64
 6   SibSp        889 non-null    int64
 7   Parch        889 non-null    int64
 8   Ticket       889 non-null    object
 9   Fare         889 non-null    float64
 10  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(4)
memory usage: 83.3+ KB

In [71]:
dt_cat_encoded, dt_cat_categories = dt_cat.factorize()

In [72]:
dt_cat_encoded[:10]

array([0, 1, 0, 0, 0, 2, 0, 0, 0, 1], dtype=int64)

In [73]:
dt_train_wout_cabin['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)